#+TITLE: January 31, 2018 - February 16, 2018
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                                     | WAITING | DONE                                                         | CANCELED |
|------+------+-------------------------------------------------+---------+--------------------------------------------------------------+----------|
|      |      | READ.1517824350. Course DO276                   |         | READ.1517381689. You Don't Know JavaScript - Sc (2018-02-09) |          |
|      |      | READ.1517824537. You Don't Know JavaScript - th |         |                                                              |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME      | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|-----------+-----------+--------+------+-----------+--------------+------------|
| Pradhvan  |         0 |      0 |    0 |         0 |   2018-02-13 | ---------- |
| Sandeepk  |      19.0 |   6.92 |  7.0 |      12.0 |   2018-03-01 | ####------ |
| Bhavin192 |      14.5 |   8.12 |    0 |      14.5 |   2018-03-06 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  90 +---------------------------------------------------------------------+   
:     |   #####################################                             |   
:  80 |+  ....                                 ##################AL #######+|   
:     |       ....                                            IDEAL ....... |   
:  70 |+          ....                                                     +|   
:     |               .....                                                 |   
:  60 |+                   ....                                            +|   
:     |                        ....                                         |   
:  50 |+                           ....                                    +|   
:     |                                ....                                 |   
:  40 |+                                   ....                            +|   
:     |                                        ....                         |   
:  30 |+                                           ....                    +|   
:     |                                                .....                |   
:  20 |+                                                    ....           +|   
:     |                                                         ....        |   
:  10 |+                                                            ....   +|   
:     |                                                                 ....|   
:   0 +---------------------------------------------------------------------+   
:     0       2       4        6       8       10      12       14      16      
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------+-------+-----------------|
|   1 | 2018-01-31 |   85.5 |    80 |                 |
|   2 | 2018-02-01 |   85.5 |    75 |                 |
|   3 | 2018-02-02 |   85.5 |    70 |                 |
|   4 | 2018-02-03 |   85.5 |    65 |                 |
|   5 | 2018-02-04 |   85.5 |    60 |                 |
|   6 | 2018-02-05 |   85.5 |    55 |                 |
|   7 | 2018-02-06 |   85.5 |    50 |                 |
|   8 | 2018-02-07 |   85.5 |    45 |                 |
|   9 | 2018-02-08 |   85.5 |    40 |                 |
|  10 | 2018-02-09 |   78.5 |    35 | READ.1517381689 |
|  11 | 2018-02-10 |   78.5 |    30 |                 |
|  12 | 2018-02-11 |   78.5 |    25 |                 |
|  13 | 2018-02-12 |   78.5 |    20 |                 |
|  14 | 2018-02-13 |   78.5 |    15 |                 |
|  15 | 2018-02-14 |        |    10 |                 |
|  16 | 2018-02-15 |        |     5 |                 |
|  17 | 2018-02-16 |        |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                          | TASKID          | OWNER     | PRIORITY | TODO        | ESTIMATED | ACTUAL |
|---------------------------------------------------------------+-----------------+-----------+----------+-------------+-----------+--------|
| TASKS                                                         |                 |           | B        |             |      85.5 |  15.04 |
|---------------------------------------------------------------+-----------------+-----------+----------+-------------+-----------+--------|
| Data Structures and Algorithms in Python                      | READ.1518502531 | pradhvan  | B        |             |      52.0 |        |
|---------------------------------------------------------------+-----------------+-----------+----------+-------------+-----------+--------|
| Course DO276                                                  | READ.1517824350 | bhavin192 | B        | IN_PROGRESS |      14.5 |   8.12 |
|---------------------------------------------------------------+-----------------+-----------+----------+-------------+-----------+--------|
| You Don't Know JavaScript - this & Object Prototypes Part III | READ.1517824537 | sandeepK  | B        | IN_PROGRESS |      12.0 |   3.42 |
|---------------------------------------------------------------+-----------------+-----------+----------+-------------+-----------+--------|
| You Don't Know JavaScript - Scope & Closures Part II          | READ.1517381689 | sandeepK  | B        | DONE        |       7.0 |   3.50 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2018-01-31 Wed>
  :wpd-bhavin192: 1
  :wpd-sandeepK: 1
  :wpd-pradhvan: 2
  :END:
** Data Structures and Algorithms in Python [/]
   :PROPERTIES:
   :ESTIMATED: 52.0
   :ACTUAL:
   :OWNER: pradhvan
   :ID: READ.1518502531
   :TASKID: READ.1518502531
   :END:
   https://www.wiley.com/en-us/Data+Structures+and+Algorithms+in+Python-p-9781118290279

   - [ ] Chapter 1: Python Primer
   - [ ] Chapter 2: Object-Oriented Programming
   - [ ] Chapter 3: Algorithm Analysis
   - [ ] Chapter 4: Recursion

** IN_PROGRESS Course DO276 [4/9]
   :PROPERTIES:
   :ESTIMATED: 14.5
   :ACTUAL:   8.12
   :OWNER: bhavin192
   :ID: READ.1517824350
   :TASKID: READ.1517824350
   :END:
   :LOGBOOK:
   CLOCK: [2018-02-08 Thu 19:40]--[2018-02-08 Thu 20:10] =>  0:30
   CLOCK: [2018-02-07 Wed 19:45]--[2018-02-07 Wed 21:15] =>  1:30
   CLOCK: [2018-02-06 Tue 21:55]--[2018-02-06 Tue 22:38] =>  0:43
   CLOCK: [2018-02-05 Mon 19:25]--[2018-02-05 Mon 20:25] =>  1:00
   CLOCK: [2018-02-04 Sun 15:25]--[2018-02-04 Sun 16:50] =>  1:25
   CLOCK: [2018-02-03 Sat 13:31]--[2018-02-03 Sat 14:38] =>  1:07
   CLOCK: [2018-02-02 Fri 19:55]--[2018-02-02 Fri 20:41] =>  0:46
   CLOCK: [2018-02-01 Thu 19:39]--[2018-02-01 Thu 20:45] =>  1:06
   :END:
   - [X] Chapter 1
   - [X] Chapter 2
   - [X] Chapter 3
   - [X] Chapter 4
   - [ ] Chapter 5
   - [ ] Chapter 6
   - [ ] Chapter 7
   - [ ] Chapter 8
   - [ ] Chapter 9
** IN_PROGRESS You Don't Know JavaScript - this & Object Prototypes Part III [1/4]
   :PROPERTIES:
   :ESTIMATED: 12.0
   :ACTUAL:   3.42
   :OWNER: sandeepK
   :ID: READ.1517824537
   :TASKID: READ.1517824537
   :END:
   :LOGBOOK:
   CLOCK: [2018-02-10 Sat 23:00]--[2018-02-10 Sat 23:40] =>  0:40
   CLOCK: [2018-02-09 Fri 23:55]--[2018-02-10 Sat 00:30] =>  0:35
   CLOCK: [2018-02-08 Thu 00:00]--[2018-02-08 Thu 00:30] =>  0:30
   CLOCK: [2018-02-06 Tue 23:00]--[2018-02-07 Wed 00:00] =>  1:00
   CLOCK: [2018-02-05 Mon 23:00]--[2018-02-05 Mon 23:40] =>  0:40
   :END:
   - [X] Chapter 1: this Or That?
   - [ ] Chapter 2: this All Makes Sense Now!
   - [ ] Chapter 3: Objects
   - [ ] Chapter 4: Mixing (Up) "Class" Objects
** DONE You Don't Know JavaScript - Scope & Closures Part II [3/3]
   CLOSED: [2018-02-09 Fri 14:47]
   :PROPERTIES:
   :ESTIMATED: 7.0
   :ACTUAL:   3.50
   :OWNER: sandeepK
   :ID: READ.1517381689
   :TASKID: READ.1517381689
   :END:
   :LOGBOOK:
   CLOCK: [2018-02-04 Sun 17:10]--[2018-02-04 Sun 18:00] =>  0:50
   CLOCK: [2018-02-02 Fri 23:00]--[2018-02-02 Fri 23:50] =>  0:50
   CLOCK: [2018-01-31 Wed 23:00]--[2018-01-31 Wed 23:50] =>  0:50
   CLOCK: [2018-02-01 Thu 23:00]--[2018-02-02 Fri 00:00] =>  1:00
   :END:
   - [X] Chapter 3: Function vs. Block Scope
   - [X] Chapter 4: Hoisting
   - [X] Chapter 5: Scope Closures
